/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dsedlets <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/03/03 03:52:57 by dsedlets          #+#    #+#             */
/*   Updated: 2024/03/03 03:59:03 by dsedlets         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
/* 
 * Возвращает последний элемент списка.
 *
 * While пока lst не станет равным NULL и пока у текущего элемента есть 
 *  следующий элемент.
 */

#include "libft.h"

t_list	*ft_lstlast(t_list *lst)
{
	while (lst && lst->next)
		lst = lst->next;
	return (lst);
}
